// Задача 1
// Функция принимает 3 переменных:
// - животное -> animal
// - локация -> loc
// - что говорит -> say
// возвращает объект с ключами по имени переменных {animal: loc: say:}
// Работает по массиву [["cat", "home", "meow"], ["dog", "garden", "woof"], ["horse", "forest", "iho"]]
// // Результат:
// [].map(i => { function + вывод результата + вернуть резульат })
// [[], [], []] => [{}, {}, {}]

// Задача 2
// Функция принимает объект: {movie: "Akiba", year: 1965, director: "Akira Kurosawa"}
// Выводит:
// - все ключи объекта
// - все значения по ключам объекта
// - ключи и значения вместте
// Каждый вывод не зависит от предыдущего

// Задача 3
// Функция принимает текст и возвращает количество символов в нем

// Запуск: node exaples.js

// Задача 4
// Залить в репозиторий на гитхабе
